#include <iostream>

int main () 
{
    std::cout << "Введіть кількість секунд:";
    int ussec;
    std::cin >>ussec;

    double sec_in_min = 60.0;
    double min = ussec / sec_in_min;
     std::cout << "Кількість хвилин:" << min << std::endl;

     
     double min_in_hour = 60.0;
     double ush = min / min_in_hour;
     std::cout << "Кількість годин:" << ush << std::endl;



return 0;
}
/*Оператори
Бінарні
= присвоєння 

+ - * .  додавання, повертає готове значення 

унарний + , підкреслюємо те, що воно має яексь конкретне значення
унарний мінус бере значення зміної і міняє його на протележне



пріорітет операторів
порядок їх виконання. чим менше число. тим більше пріорітет у оператора

Асоціативність операторів
* і / має однаковий пріорітет. Асоціативність - порядок виконання операторів одного пріорітету. Зліва направо або справа наліво. 

Комбіновані оператирои
Арифметичні
+= збільшити на 
-= зменшити на
*= помножити
/=поділити


Інкремент - збільшити на 1
Дикремнт - зменшити на 1

Постфіксний - після, спочатку повернути значення змної , а потім збільшити
Префіксний - перед, спочатку збільшення потім повернення  
Більше чим одного диремнта інкремента на 1 змінну, бо кожен коомпілятор буде вести себе невизначено

*/