#include <iostream>

int main() {
   setlocale(LC_ALL, "UK");
   /*  std::cout << R"(Привіт!

)" << std::endl;*/

    int a = 5;
    short b = {4};
    const double PI = 3.14;
    std::cout << "a + b + PI=" << a + b + PI << std::endl;

    char ch = '\n';
    std::cout << "1" << ch << "2" <<std::endl;

    int side;
    std::cout << "Введіть сторону квадрата" << side << std::endl;
    std::cin >> side;

    int perimetr = 4 * side;
    std::cout << "Ваш периметр = " << perimetr << std::endl;

    return 0;
}
/*Raw-рядок

R ‘’() ’’ не працюють escape послідовноті.

unsigned - тільки додатні сила

Фундаментальні типи даних:
Ціле число 6
short 2 байти
int 4 байти (вибирають найчастіше)
long 4 байти
long long 8 байтів

Дробове 3
float 4 байти
double 8 байтів
long double 8 байтів

Символ 4
сhar 1 байт
wchar_t ( викор в графічних проектах)2 байти
char16_t 2 байти
char32_t 4 байти

Логічний 1 
bool 1б = будь-яке значення окрім 0 інтерпритується як правда . 0 - брехня

Синтаксис створення змінної:
Тип даних Імʼя; ( буде зберугатись сміття, пусте значення)
Тип даних Імʼя = значення;
Ініціалізація - задання значення при створені. 
Змінна - іменована область в оперативній памʼяті яка має значення певного типу даних, яке можна змінювати.
int a = 2; немає первірки
int a =  {2} однакове з 3 , бо мають перевірку.
int a {2}
int a (2) немає перевірки


int a, b;
int a;
int b;

Константи 
const тип даних імя = значення;
сonst double PI  = 3,14159;
Не можемо змінити ії значення
Використовуємо для підкреслення значення того, що вона не змінюється. При допусканні помилки ця помилка буде показана.

Ввід інформації
сin = ввід символів
cin >> number;
Магічне число- значення якогго треьа пояснбвати.*/