#include <iostream> /* #include  « підключити » - команда препроцессора. В <…..> пишемо файл , який треба підклюити до даного файлу.
Скопіювати те, що знаходиться в іншому файлі.
<iostream> - інформація про потік вводу та виводу інформації.*/
int main()
{
    setlocale(LC_ALL, "UK");

    std::cout << "Пивіт!";
    std::cout << "Hello!" << std::endl;
    std::cout << std::endl;/* endl « end line »- маніпулятор, інструмент, який знаходиться в просторі імен std. 
    Перевод курсору на новий рядок. Необмежена кількість викорисатння. Завжди перед <<*/
    std::cout << "Hello World!\n";/*/*Escape послідовність - коомбінація бек слешу \ та якоїсь букви або числа, 
використовуються для виконання роботи при виведенні на екран.

\’’- використовуються для подвійних лапок
\’ - одинарні лапки
\? - оминання триграфів
\\ - виведення бекслешу
\а- проїгрування одинарного системного звуку. Запустити системниий динамік. 
\b - скорочення backspace, в термінале курсор повертається на одну букву назад. Можна замінювати букви при виведенні.
\f - переніс курсору на нову сторінкуЮ, виористовуються при написанні документів.
\v - переніс курсору на наступну вертикальну табуляцію.
\t - горизонтпльна табуляція,ю пишемо всередені між цифрами
\n - enter
\r - переніс курсору на початок даного рядка.*/
    std::cout << "\"Hello World!\"" << std::endl;
    std::cout << "Hello World!\b\b\b";
    std::cout << "y" << std::endl;
    std::cout << "\\Hello World!\\" << std::endl;

    return 0; /*cout - інстркмент, чкий виводить інформацію на екран.
сout << ’’текст’’ ;
Ставимо крапку з комою, коли це команда.
Простір імен std.*/
}

